'use strict'

const vacancy = document.querySelector('#vacancy')
const searchVacanciesButton = document.querySelector('#searchVacanciesButton')

const spaceBefore = document.querySelector('#spaceBefore')
const counter = document.querySelector('#counter')
const spinner = document.querySelector('#spinner')
const spinnerInner = document.querySelector('#spinner-inner')
const waitParagraph = document.querySelector('#waitParagraph')
// const progressbar = document.querySelector('#progressbar')
// const progressbarLoader = document.querySelector('#progressbar-loader')
const okButton = document.querySelector('#okButton')
const spaceAfter = document.querySelector('#spaceAfter')

let stompClient = null;
let username = null;

function connect(event) {
    event.preventDefault();

    username = document.querySelector('#username').value;
    if (username) {
        const socket = new SockJS('/ws');

        stompClient = Stomp.over(socket);
        stompClient.connect({}, onConnected, onError);
    }
}

function disconnect() {
    if (stompClient !== null) {
        stompClient.disconnect();
    }
    console.log("Disconnected");
}

function onConnected() {
    // Subscribe to the Public Topic
    stompClient.subscribe('/topic/public', onMessageReceived);

    // Tell your username to the server
    stompClient.send("/app/chat.addUser",
        {},
        JSON.stringify({sender: username, type: 'JOIN'})
    )
}

function onError(error) {
    // connectingElement.textContent = 'Could not connect to WebSocket server. Please refresh this page to try again!';
    // connectingElement.style.color = 'red';
    console.log('Error connecting to websocket server: ' + error)
}

function onMessageReceived(payload) {
    let message = JSON.parse(payload.body);

    switch (message.type) {
        case 'JOIN':
            counter.textContent = '0%'
            // progressbarLoader.style.width = '0%'
            sendMessage()
            break
        case 'LEAVE':
            console.log('left')
            break
        case 'RECEIVE':
            let messageCounter = parseInt(message.content).toFixed(0) + '%'
            counter.textContent = messageCounter
            // progressbarLoader.style.width = messageCounter
            if (parseInt(message.content) >= 100) {
                spinner.style.display = 'none'
                waitParagraph.style.display = 'none'
                counter.textContent = 'Готово!'
                counter.classList.remove('text-warning')
                counter.classList.add('text-success')
                document.getElementById('cancelForm').style.display = 'none';
                okButton.style.display = ''
                window.onbeforeunload = null;
                disconnect()
                setTimeout(() => {
                    counter.style.display = 'none'
                    okButton.style.display = 'none'
                    spaceAfter.style.display = 'none'
                    spaceBefore.style.display = 'none'
                    vacancy.style.display = ''
                }, 5000);

            }
            break
    }
}

function sendMessage() {
    window.onbeforeunload = () => "You have attempted to leave this page.  If you have made any changes to the fields without clicking the Save button, your changes will be lost.  Are you sure you want to exit this page?";

    const title = document.querySelector("#title").value
    const salary = document.querySelector('#salary').value
    const onlyWithSalary = document.querySelector('#onlyWithSalary').checked
    const experience = parseInt(document.querySelector('input[name="experience"]:checked').value)
    const cityId = parseInt(document.querySelector('#cityId').value)
    const isRemoteAvailable = document.querySelector('#isRemoteAvailable').checked
    const type = 'CHAT'
    const message = {username, title, salary, onlyWithSalary, experience, cityId, isRemoteAvailable, type}
    if (message && stompClient) {
        // hide vacancy form and show progressbar, counter
        spaceBefore.style.display = ''
        vacancy.style.display = 'none'
        spinner.style.display = ''
        document.querySelector('#cancelForm').style.display = ''
        // progressbar.style.display = ''
        // document.querySelector('#can/celButton').style.display = ''
        counter.style.display = ''
        spaceAfter.style.display = ''

        stompClient.send("/app/chat.sendMessage", {}, JSON.stringify(message));
    }
}

window.addEventListener('unload', disconnect);
if (searchVacanciesButton != null) {
    searchVacanciesButton.addEventListener('click', connect)
}

// document.addEventListener("DOMContentLoaded", () => {
//     // Получаем радиобоксы и формы
//     // const vacancyRadio = document.getElementById("vac");
//     // const statisticsRadio = document.getElementById("stat");
//     // const vacancyForm = document.getElementById("vacancyForm");
//     // const statisticsForm = document.getElementById("statisticsForm");
//
//     // Функция для скрытия формы вакансии и показа формы статистики
//     // function showStatisticsForm() {
//     //     vacancyForm.style.display = "none";
//     //     statisticsForm.style.display = "";
//     // }
//
//     // Функция для скрытия формы статистики и показа формы вакансии
//     // function showVacancyForm() {
//     //     // statisticsForm.style.display = "none";
//     //     vacancyForm.style.display = "";
//     // }
//
//     // Обработчики событий для радиобоксов
//     // vacancyRadio.addEventListener("change", function () {
//     //     if (vacancyRadio.checked) {
//     //         showVacancyForm();
//     //     }
//     // });
//
//     // statisticsRadio.addEventListener("change", function () {
//     //     if (statisticsRadio.checked) {
//     //         showStatisticsForm();
//     //     }
//     // });
//     // По умолчанию показываем форму вакансии
//     showVacancyForm();
// });

const statisticsFormSubmit = document.getElementById('statisticsFormSubmit')
if (statisticsFormSubmit != null) {
    statisticsFormSubmit.addEventListener('click', (event) => {
        event.preventDefault(); // Prevent form submission
        let form = document.getElementById('statisticsForm');
        let formData = new FormData(form); // Создаем объект FormData из формы

        let xhr = new XMLHttpRequest(); // Создаем объект XMLHttpRequest
        xhr.open('POST', form.action, true); // Настраиваем запрос
        xhr.onreadystatechange = function () {
            if (xhr.readyState === XMLHttpRequest.DONE) { // Проверяем, завершен ли запрос
                if (xhr.status === 200) { // Проверяем успешность запроса
                    console.log('Данные успешно отправлены на сервер');
                    // Дополнительные действия при успешной отправке данных
                } else {
                    console.error('Произошла ошибка при отправке данных:', xhr.statusText);
                }
            }
        };

        xhr.send(formData); // Отправляем данные формы на сервер

        // Скрыть форму статистики
        document.getElementById('statisticsForm').style.display = 'none';
        // document.getElementById('switchForms').style.display = 'none'

        // Показать сообщение об успешной отправке
        document.querySelector('#cancelForm').style.display = 'none'
        document.getElementById('spaceAfterAlertSuccess').style.display = '';


        document.getElementById('alertSuccess').style.display = '';
        // Установить таймер на 2 секунды для скрытия сообщения об успехе и возврата формы
        setTimeout(() => {
            // Скрыть сообщение об успешной отправке
            document.getElementById('alertSuccess').style.display = 'none';
            document.getElementById('spaceAfterAlertSuccess').style.display = 'none';

            // Вернуть форму статистики
            // document.getElementById('switchForms').style.display = ''
            document.getElementById('statisticsForm').style.display = '';
        }, 2000);
    });
}

const toggleCollapseVacancies = document.getElementById("toggleCollapse")
if (toggleCollapseVacancies != null) {
    toggleCollapseVacancies.addEventListener("click", function (e) {
        e.preventDefault();
        const collapsibleSections = document.querySelectorAll(".collapsible");
        collapsibleSections.forEach(function (section) {
            section.classList.toggle("collapsed");
            if (section.classList.contains("collapsed")) {
                document.getElementById('searchVacanciesButtonSpace').style.display = ''
                section.style.maxHeight = "0";
                section.style.opacity = "0";
                //this.innerText = "Show";
                document.getElementById('search')
            } else {
                document.getElementById('searchVacanciesButtonSpace').style.display = 'none'
                section.style.maxHeight = "none";
                section.style.opacity = "1";
                //this.innerText = "Hide";
            }
        });
    });
}

const toggleCollapseStatistics = document.getElementById('toggleCollapseStatistics')
if (toggleCollapseStatistics != null) {
    toggleCollapseStatistics.addEventListener('click', (e) => {
        e.preventDefault()
        const collapsibleSections = document.querySelectorAll(".collapsible");
        collapsibleSections.forEach((section) => {
            section.classList.toggle("collapsed");
            if (section.classList.contains("collapsed")) {
                section.style.maxHeight = "0";
                section.style.opacity = "0";
                this.innerText = "Show";
                document.getElementById('searchStatisticsButtonSpace').style.display = ''
            } else {
                section.style.maxHeight = "none";
                section.style.opacity = "1";
                this.innerText = "Hide";
                document.getElementById('searchStatisticsButtonSpace').style.display = 'none'
            }
        });
    })
}

/*Autocomplete*/
// Autocomplete для вакансий
$(() => {
    let vacanciesJobTitles = [
        "Учитель",
        "Врач-терапевт",
        "Врач-стоматолог",
        "Врач-косметолог",
        "Врач-педиатр",
        "Врач-хирург",
        "Врач-рентгенолог",
        "Аналитик",
        "Аналитик бизнес-процессов",
        "Аналитик продаж",
        "Аналитик данных",
        "Аналитик-маркетолог",
        "Аналитик 1С",
        "Аналитик СМИ",
        "Аналитик SQL",
        "Аналитик excel",
        "Инженер ПТО",
        "Инженер-конструктор",
        "Инженер-проектировщик",
        "Инженер-технолог",
        "Инженер по эксплуатации",
        "Инженер-электрик",
        "Инженер-механик",
        "Инженер-энергетик",
        "Инженер по охране труда",
        "Программист",
        "Программист 1С",
        "Программист микроконтроллеров",
        "Программист-стажер",
        "Программист Java",
        "Программист C#",
        "Программист PHP",
        "Программист Python",
        "Программист .NEW",
        "Программист Android",
        "Программист iOS",
        "Программист Node.JS",
        "Программист Angular",
        "Программист React",
        "Программист Vue",
        "Программист Django",
        "Программист FastAPI",
        "Программист SQL",
        "Медсестра",
        "Администратор",
        "Администратор салона красоты",
        "Администратор гостиницы",
        "Администратор клиники",
        "Администратор магазина",
        "Администратор ресторана",
        "Менеджер по закупкам",
        "Менеджер по туризму",
        "Менеджер проекта",
        "Менеджер по логистике",
        "Менеджер ресторана",
        "Менеджер интернет-магазина",
        "Менеджер проектов",
        "Продавец-консультант",
        "Продавец-кассир",
        "Продавец одежды",
        "Продавец продовольственных товаров",
        "Бухгалтер",
        "Адвокат",
        "Маркетолог",
        "Маркетолог-аналитик",
        "Маркетолог-стажер",
        "Рабочий",
        "Рабочий на производство",
        "Рабочий склада",
        "Рабочий персонал",
        "Дизайнер",
        "Дизайнер-верстальщик",
        "Дизайнер-консультант",
        "Дизайнер интерьеров",
        "Финансист",
        "Финансист-экономист",
        "Финансовый контролер",
        "Шеф-повар",
        "Психолог",
        "Строитель",
        "Архитектор",
        "Массажист",
        "Пожарный",
        "Полицейский",
        "Повар",
        "Фотограф",
        "Электрик",
        "Механик",
        "Логист",
        "Пилот",
        "Водитель-курьер",
        "Водитель офисный",
        "Водитель такси",
        "Монтажник",
        "Педагог",
        "Риелтор",
        "Тренер",
        "Тренер инструктор",
        "Тренер по футболу",
        "Тренер по плаванию",
        "Тренер тренажерного зала",
        "Графический дизайнер",
        "Секретарь",
        "Пекарь",
        "Техник",
        "Разнорабочий",
        "Ветеринар",
        "Маникюрша",
        "Администратор отеля",
        "Официант",
        "Аварийный комиссар",
        "Авиакассир",
        "Автовладелец",
        "Автожестянщик",
        "Автокурьер",
        "Web-администратор",
        "Багетчик",
        "Барбер",
        "Бариста",
        "Бармен",
        "Бармен-кассир",
        "Агент банка",
        "Администратор базы данных",
        "Администратор бара",
        "Аналитик бизнес-процессов",
        "Вахтер",
        "Вахтер/сторож/консьерж",
        "Веб-дизайнер",
        "Ведущий",
        "Ведущий инженер",
        "Администратор ветеринарной клиники",
        "Архитектор-визуализатор",
        "Аудитор внутренний",
        "Бухгалтер в банк",
        "Газовщик",
        "Газорезчик",
        "Газоэлектросварщик",
        "Гальваник",
        "Гастрономист",
        "Администратор гостиницы",
        "Акушер-гинеколог",
        "Архитектор главный",
        "Бухгалтер материальной группы",
        "Ведущий специалист, Главный специалист",
        "Дальнобойщий",
        "Дворник",
        "Дегустатор",
        "Дезинфектор",
        "Декларант",
        "3д-дизайнер",
        "UI/UX-дизайнер",
        "Администратор дежурный",
        "Администратор детского центра",
        "Животновод",
        "Жиловщик",
        "Журналист",
        "Агент по жилой недвижимости",
        "Консультант по жилой недвижимости",
        "Заведующий",
        "Заведующий залом",
        "Заведующий кассой",
        "Заведующий кафедрой",
        "Заведующий кулинарным цехом",
        "Агент по загородной недвижимости",
        "Администратор зала",
        "Администратор студии загара",
        "Администратор торгового зала",
        "Ассистент отдела закупок",
        "Иллюстратор",
        "Имплантолог",
        "Инженер",
        "Инженер ВК",
        "Инженер ВОЛС",
        "Web-инженер",
        "Администратор интернет-магазина",
        "Ведущий инженер",
        "Водитель-инкассатор",
        "Военный инженер",
        "Тренер по йоге",
        "Кабельщик",
        "Кабельщик-спайщик",
        "Кадровик",
        "Казначей",
        "Калькулятор",
        "SEO-копирайтер",
        "Агент коммерческий",
        "Агент по коммерческой недвижимости",
        "Лаборант",
        "Лаборант химического анализа",
        "Лектор",
        "Лесник",
        "Лингвист",
        "Аналитик-логистик",
        "Водитель личный",
        "Дизайнер ландшафта",
        "Дизайнер ландшафтный",
        "Директор по логистике",
        "Макетчик",
        "Макетчик (постпечатник)",
        "Макетчик наружной рекламы",
        "Макетчик-монтажник",
        "Макетчик-поклейщик",
        "3д-моделлер",
        "Event-менеджер",
        "HR-менеджер",
        "PR-менеджер",
        "Web-мастер",
        "Наборщик текста",
        "Наладчик",
        "Наладчик КИПиА",
        "Наладчик полиграфического оборудования",
        "Налоговый инспектор",
        "Агент по недвижимости",
        "Администратор на ресепшн",
        "Обвальщик",
        "Облицовщик",
        "Обмотчик",
        "Озеленитель",
        "Океанолог",
        "SEO-оптимизатор",
        "Администратор отдела продаж",
        "Администратор офиса",
        "Актер озвучки",
        "Палеонтолог",
        "Парикмахер",
        "Парикмахер женский",
        "Парикмахер мужской",
        "Паркетчик",
        "Web-программист",
        "Автомаляр-подготовщик",
        "Агент по аренде",
        "Работник АХО",
        "Работник кухни",
        "Работник ресторана",
        "Работник склада",
        "Работник торгового зала",
        "Frontend-разработчик",
        "Агент рекламный",
        "Администратор ресторана",
        "Ассистент рекрутера",
        "Садовник",
        "Садовод",
        "Санитар",
        "Санитарка",
        "Сантехник",
        "HR-специалист",
        "SEO-специалист",
        "Администратор компьютерных сетей",
        "Администратор сайта",
        "Администратор салона",
        "Табельщик",
        "Тайный покупатель",
        "Такелажник",
        "Таксист",
        "Талассотерапевт",
        "Web-технолог",
        "Агент торговый",
        "Актер театра",
        "Артист театра",
        "Уборщик",
        "Уборщик вечерний",
        "Уборщик производственных помещений",
        "Уборщик складских помещений",
        "Уборщик служебных помещений",
        "Бригадир уборщиц",
        "Бухгалтер на участок",
        "Бухгалтер по учету ТМЦ",
        "Врач УЗИ",
        "Грузчик-упаковщик",
        "Фальцовщик",
        "Фармацевт",
        "Фасадчик",
        "Фасовщик",
        "Фельдшер",
        "Администратор фитнес-клуба",
        "Аналитик финансовый",
        "Ветеринарный фельдшер",
        "Водитель фуры",
        "Врач функциональной диагностики",
        "Хаус-мастер",
        "Химик",
        "Химик-лаборант",
        "Химик-технолог",
        "Хирург",
        "Ветеринарный врач хирург",
        "Инженер по холодильному оборудованию",
        "Инженер-химик",
        "Мастер по ремонту холодильников",
        "Цветовод",
        "Циклевщик",
        "Администратор медицинского центра",
        "Заместитель начальника цеха",
        "Инженер-разработчик цифровой аппаратуры",
        "Чайный мастер",
        "Чертежник",
        "Чистильщик металла",
        "Мастер часовой",
        "Оператор ЧПУ",
        "Охранник в ЧОП",
        "Специалист по обслуживанию частных лиц",
        "Токарь ЧПУ",
        "Швейцар",
        "Швея",
        "Швея по пошиву штор",
        "Швея-закройщица",
        "Швея-мотористка",
        "Бренд-шеф",
        "Водитель штабелера",
        "Дизайнер штор",
        "Директор школы",
        "Конструктор швейного производства",
        "Эвакуаторщик",
        "Эколог",
        "Экономист",
        "Экономист ведущий",
        "Экономист по планированию",
        "Бухгалтер-экономист",
        "Водитель эвакуатора",
        "Водитель-экспедитор",
        "Врач-эксперт",
        "Главный энергетик",
        "Ювелир",
        "Юрисконсульт",
        "Юрист",
        "Юрист младший",
        "Юрист старший",
        "Начальник юридического отдела",
        "Полировщик-ювелир",
        "Помощник юрисконсульта",
        "Помощник юриста",
        "Продавец ювелирных изделий",
        "Педагог по английскому языку",
        "Переводчик китайского языка",
        "Переводчик корейского языка",
        "Преподаватель иностранного языка",
        "Распространитель по почтовым ящикам",
        "Менеджер",
        "Продавец",
        "Оператор",
        "Менеджер по продажам",
        "Врач",
        "Водитель",
        "Инженер",
        "Слесарь",
        "Кассир",
        "Консультант"
    ]
    // Initialize autocomplete on the title input field
    $("#title").autocomplete({
        source: vacanciesJobTitles // Use the array as the data source
    });
});

// Для статистики
$(() => {
    // Array of example job titles for autocomplete
    let statisticsJobTitles = [
        "Аварийный комиссар",
        "Авиакассир",
        "Автовладелец",
        "Автожестянщик",
        "Автокурьер",
        "Web-администратор",
        "Багетчик",
        "Барбер",
        "Бариста",
        "Бармен",
        "Бармен-кассир",
        "Агент банка",
        "Администратор базы данных",
        "Администратор бара",
        "Аналитик бизнес-процессов",
        "Вахтер",
        "Вахтер/сторож/консьерж",
        "Веб-дизайнер",
        "Ведущий",
        "Ведущий инженер",
        "Администратор ветеринарной клиники",
        "Архитектор-визуализатор",
        "Аудитор внутренний",
        "Бухгалтер в банк",
        "Газовщик",
        "Газорезчик",
        "Газоэлектросварщик",
        "Гальваник",
        "Гастрономист",
        "Администратор гостиницы",
        "Акушер-гинеколог",
        "Архитектор главный",
        "Бухгалтер материальной группы",
        "Ведущий специалист, Главный специалист",
        "Дальнобойщий",
        "Дворник",
        "Дегустатор",
        "Дезинфектор",
        "Декларант",
        "3д-дизайнер",
        "UI/UX-дизайнер",
        "Администратор дежурный",
        "Администратор детского центра",
        "Животновод",
        "Жиловщик",
        "Журналист",
        "Агент по жилой недвижимости",
        "Консультант по жилой недвижимости",
        "Заведующий",
        "Заведующий залом",
        "Заведующий кассой",
        "Заведующий кафедрой",
        "Заведующий кулинарным цехом",
        "Агент по загородной недвижимости",
        "Администратор зала",
        "Администратор студии загара",
        "Администратор торгового зала",
        "Ассистент отдела закупок",
        "Иллюстратор",
        "Имплантолог",
        "Инженер",
        "Инженер ВК",
        "Инженер ВОЛС",
        "Web-инженер",
        "Администратор интернет-магазина",
        "Ведущий инженер",
        "Водитель-инкассатор",
        "Военный инженер",
        "Тренер по йоге",
        "Кабельщик",
        "Кабельщик-спайщик",
        "Кадровик",
        "Казначей",
        "Калькулятор",
        "SEO-копирайтер",
        "Агент коммерческий",
        "Агент по коммерческой недвижимости",
        "Лаборант",
        "Лаборант химического анализа",
        "Лектор",
        "Лесник",
        "Лингвист",
        "Аналитик-логистик",
        "Водитель личный",
        "Дизайнер ландшафта",
        "Дизайнер ландшафтный",
        "Директор по логистике",
        "Макетчик",
        "Макетчик (постпечатник)",
        "Макетчик наружной рекламы",
        "Макетчик-монтажник",
        "Макетчик-поклейщик",
        "3д-моделлер",
        "Event-менеджер",
        "HR-менеджер",
        "PR-менеджер",
        "Web-мастер",
        "Наборщик текста",
        "Наладчик",
        "Наладчик КИПиА",
        "Наладчик полиграфического оборудования",
        "Налоговый инспектор",
        "Агент по недвижимости",
        "Администратор на ресепшн",
        "Обвальщик",
        "Облицовщик",
        "Обмотчик",
        "Озеленитель",
        "Океанолог",
        "SEO-оптимизатор",
        "Администратор отдела продаж",
        "Администратор офиса",
        "Актер озвучки",
        "Палеонтолог",
        "Парикмахер",
        "Парикмахер женский",
        "Парикмахер мужской",
        "Паркетчик",
        "Web-программист",
        "Автомаляр-подготовщик",
        "Агент по аренде",
        "Работник АХО",
        "Работник кухни",
        "Работник ресторана",
        "Работник склада",
        "Работник торгового зала",
        "Frontend-разработчик",
        "Агент рекламный",
        "Администратор ресторана",
        "Ассистент рекрутера",
        "Садовник",
        "Садовод",
        "Санитар",
        "Санитарка",
        "Сантехник",
        "HR-специалист",
        "SEO-специалист",
        "Администратор компьютерных сетей",
        "Администратор сайта",
        "Администратор салона",
        "Табельщик",
        "Тайный покупатель",
        "Такелажник",
        "Таксист",
        "Талассотерапевт",
        "Web-технолог",
        "Агент торговый",
        "Актер театра",
        "Артист театра",
        "Уборщик",
        "Уборщик вечерний",
        "Уборщик производственных помещений",
        "Уборщик складских помещений",
        "Уборщик служебных помещений",
        "Бригадир уборщиц",
        "Бухгалтер на участок",
        "Бухгалтер по учету ТМЦ",
        "Врач УЗИ",
        "Грузчик-упаковщик",
        "Фальцовщик",
        "Фармацевт",
        "Фасадчик",
        "Фасовщик",
        "Фельдшер",
        "Администратор фитнес-клуба",
        "Аналитик финансовый",
        "Ветеринарный фельдшер",
        "Водитель фуры",
        "Врач функциональной диагностики",
        "Хаус-мастер",
        "Химик",
        "Химик-лаборант",
        "Химик-технолог",
        "Хирург",
        "Ветеринарный врач хирург",
        "Инженер по холодильному оборудованию",
        "Инженер-химик",
        "Мастер по ремонту холодильников",
        "Цветовод",
        "Циклевщик",
        "Администратор медицинского центра",
        "Заместитель начальника цеха",
        "Инженер-разработчик цифровой аппаратуры",
        "Чайный мастер",
        "Чертежник",
        "Чистильщик металла",
        "Мастер часовой",
        "Оператор ЧПУ",
        "Охранник в ЧОП",
        "Специалист по обслуживанию частных лиц",
        "Токарь ЧПУ",
        "Швейцар",
        "Швея",
        "Швея по пошиву штор",
        "Швея-закройщица",
        "Швея-мотористка",
        "Бренд-шеф",
        "Водитель штабелера",
        "Дизайнер штор",
        "Директор школы",
        "Конструктор швейного производства",
        "Эвакуаторщик",
        "Эколог",
        "Экономист",
        "Экономист ведущий",
        "Экономист по планированию",
        "Бухгалтер-экономист",
        "Водитель эвакуатора",
        "Водитель-экспедитор",
        "Врач-эксперт",
        "Главный энергетик",
        "Ювелир",
        "Юрисконсульт",
        "Юрист",
        "Юрист младший",
        "Юрист старший",
        "Начальник юридического отдела",
        "Полировщик-ювелир",
        "Помощник юрисконсульта",
        "Помощник юриста",
        "Продавец ювелирных изделий",
        "Педагог по английскому языку",
        "Переводчик китайского языка",
        "Переводчик корейского языка",
        "Преподаватель иностранного языка",
        "Распространитель по почтовым ящикам",
        "Менеджер",
        "Продавец",
        "Оператор",
        "Менеджер по продажам",
        "Врач",
        "Водитель",
        "Инженер",
        "Слесарь",
        "Кассир",
        "Консультант"
    ];
    let statisticsCityTitles = [
        "Астрахань",
        "Архангельск",
        "Комсомольск-на-Амуре",
        "Ангарск",
        "Абакан",
        "Армавир",
        "Алеметьевск",
        "Артем",
        "Алчевск",
        "Арзамас",
        "Барнаул",
        "Балашиха",
        "Брянск",
        "Белгород",
        "Благовещенск",
        "Братск",
        "Балаково",
        "Бийск",
        "Березники",
        "Воронеж",
        "Волгоград",
        "Владивосток",
        "Владимир",
        "Волжский",
        "Волгда",
        "Владикавказ",
        "Великий Новгород",
        "Вологодонск",
        "Видное",
        "Грозный",
        "Горловка",
        "Гатчина",
        "Глазов",
        "Губкин",
        "Геленджик",
        "Гудермес",
        "Горно-Алтайск",
        "Георгиевск",
        "Гуково",
        "Ростов-на-Дону",
        "Донецк",
        "Дзержинск",
        "Домодедово",
        "Дербент",
        "Долгопрудный",
        "Димитровград",
        "Дубна",
        "Дмитров",
        "Донской",
        "Екатеринбург",
        "Ессентуки",
        "Евпатория",
        "Енакиево",
        "Елец",
        "Ейск",
        "Елабуга",
        "Егорьевск",
        "Ефремов",
        "Елизово",
        "Железнодорожный",
        "Жуковский",
        "Железногорск",
        "Жигулевск",
        "Запорожье",
        "Зеленоград",
        "Златоуст",
        "Орехово-Зуево",
        "Зеленодольск",
        "Зеленогорск",
        "Заринск",
        "Заинск",
        "Переславль-Залесский",
        "Заволжье",
        "Ижевск",
        "Иркутск",
        "Иваново",
        "Ивантеевка",
        "Усть-Илимск",
        "Ишим",
        "Ишимбай",
        "Искитим",
        "Избербаш",
        "Изобильный",
        "Йошкар-Ола",
        "Казань",
        "Красноярск",
        "Краснодар",
        "Кемерово",
        "Калининград",
        "Киров",
        "Курск",
        "Калуга",
        "Курган",
        "Кострома",
        "Липецк",
        "Луганск",
        "Люберцы",
        "Ленинск-Кузнецкий",
        "Великие Луки",
        "Лобня",
        "Лыткарино",
        "Лениногорск",
        "Лабинск",
        "Лесосибирск",
        "Москва",
        "Махачкала",
        "Мариуполь",
        "Магнитогорск",
        "Макеевка",
        "Мурманск",
        "Мытищи",
        "Мелитополь",
        "Миасс",
        "Майкоп",
        "Новосибирск",
        "Нижний Новгород",
        "Набережные Челны",
        "Новокузнецк",
        "Нижний Тагил",
        "Нижневартовск",
        "Новороссийск",
        "Нальчик",
        "Нижнекамск",
        "Омск",
        "Оренбург",
        "Орел",
        "Старый Оскол",
        "Орск",
        "Одинцово",
        "Обнинск",
        "Октябрьский",
        "Санкт-Петербург",
        "Пермь",
        "Пенза",
        "Подольск",
        "Петрозаводск",
        "Псков",
        "Прокопьевск",
        "Петропавловск-Камчатский",
        "Пятигорск",
        "Первоуральск",
        "Рязань",
        "Рыбинск",
        "Рубцовск",
        "Раменское",
        "Реутов",
        "Россошь",
        "Ревда",
        "Ржев",
        "Рассказово",
        "Самара",
        "Саратов",
        "Севастополь",
        "Ставрополь",
        "Сочи",
        "Сургут",
        "Симферополь",
        "Смоленск",
        "Саранск",
        "Тюмень",
        "Тольятти",
        "Томск",
        "Тула",
        "Тверь",
        "Тамбов",
        "Таганрог",
        "Тобольск",
        "Троицк",
        "Уфа",
        "Ульяновск",
        "Улан-Удэ",
        "Уссурийск",
        "Каменск-Уральский",
        "Новый Уренгой",
        "Ухта",
        "Усолье-Сибирское",
        "Урус-Мартан",
        "Наро-Фоминск",
        "Феодосия",
        "Фрязино",
        "Фролово",
        "Фурманов",
        "Хабаровск",
        "Херсон",
        "Химки",
        "Хасавюрт",
        "Ханты-Мансийск",
        "Гусь-Хрустальный",
        "Челябинск",
        "Чебоксары",
        "Чита",
        "Череповец",
        "Черкесск",
        "Чехов",
        "Чайковский",
        "Черногорск",
        "Чапаевский",
        "Шахты",
        "Каменск-Шахтинский",
        "Шадринск",
        "Шали",
        "Шуя",
        "Шелехов",
        "Шебекино",
        "Шарыпово",
        "Шумерля",
        "Шарья",
        "Щелково",
        "Щекино",
        "Энгельс",
        "Электросталь",
        "Элиста",
        "Южно-Сахалиеск",
        "Южноуральск",
        "Пыть-Ях",
        "Ялуторовск"
    ]

    // Initialize autocomplete on the title input field
    $("#profession").autocomplete({
        source: statisticsJobTitles // Use the array as the data source
    });
    $("#city").autocomplete({
        source: statisticsCityTitles
    })
});